var ideas = {
	genericIntro : {
		collected : true,
		converted : false,
		pages : 8,
		topicText : 'Обозначить вступление через проблематику мировой энергетики сегодня',
		replyText : "У вас неплохо получилось перейти от общего к частному - теме вашего диплома. Должно зацепить внимательного читателя.",
		collectText : 'Вам в голову пришла идея, как растянуть общие знания по теме на несколько страниц вступления к диплому.',
	},
	
	consumerismBody : {
		collected : false,
		converted : false,
		pages : 17,
		topicText : 'Обратить внимание на неэффективность расхода энергии в условиях, так называемого, "Общества потребления".',
		replyText : "Вам удаётся развить мысль, сослаться на зависимость развития энергетики от социо-экономических факторов. Ничего сверхестественного, но мысль довольно плотная.",
		collectText : 'Осознание непрактичности некоторых решений принятых обществом за норму наводит вас на размышления о необходимости создания правильного образа возобновляемых ресурсов.',
	},
	
	examplesBody : {
		collected : false,
		converted : false,
		pages : 9,
		topicText : 'Сослаться на положительные примеры других стран.',
		replyText : "Набрав несколько примеров стран перешедших на следующий качественный уровень использования энергетических ресурсов, вы выявляете несколько важных закономерностей.",
		collectText : '"А у других как?.." – эхом проносится в вашей голове. Кажется, неплохо было бы обратиться к опыту экономик других стран.',
	},
	
	// График роста и изменений
	statsBody : {
		collected : false,
		converted : false,
		pages : 7,
		topicText : 'Изучить статистические данные за последние 50 лет, и приложить обнародованные прогнозы.',
		replyText : "Ваш документ теперь украшают несколько красивых объёмных графиков. Слава шаблонам оформления – веселенькие цвета придают оптимизма вашему документу. Но не вам.",
		collectText : 'Внезапно перед вашими глазами рисуется стройная диаграмма… Вы не понимаете как и почему, но слово СТАТИСТИКА начинает приятно греть вам сердце.',
	},
	
	//Экологическая сторона
	ecologyProblem : {
		collected : false,
		converted : false,
		pages : 16,
		topicText : 'Спровоцировать читателя, представив ему в красках возможную экологическую катастрофу.',
		replyText : "Несколько ненаучным и неожиданно художественным языком вы описываете возможное безрадостное будущее. Клише в духе Фоллаута кажутся излишними, но вы не в силах их удалить.",
		collectText : 'Вы ловите себя на том, что представляете себе мир будущего. Безрадостное болото очень впечатляет вас. Вам очень хочется поделиться этим захватывающим и реалистичным образом.',
	},
	
	//Заинтересованность потребителей
	consumerPlan : {
		collected : false,
		converted : false,
		pages : 8,
		topicText : 'Порассуждать на тему заинтересованности потребителей в альтернативных источниках энергии.',
		replyText : "Пламенной речью заправского политика вы призываете читателя пользоваться новейшими, безопасными, инновационными... Этими... Как их... А, не важно.",
		collectText : 'Постепенно вы начинаете размышлять о том, насколько вы были слепы к окружающему миру. Не желая нести за это ответственность в одиночку, вы задумываетесь, о том, что кто-нибудь мог бы указать вам на это раньше.',
	},
	
	//Заинтересованность производителей
	producerPlan : {
		collected : false,
		converted : false,
		pages : 11,
		topicText : 'Перечислить несколько преимуществ возобновляемых источников энергии для производителей техники.',
		replyText : "Текст который вы выдали больше напоминает имиджевую брошюру какого-нибудь предприятия. Вы так и видите перед собой масляный взгляд какого-нибудь архитипичного хозяйственника.",
		collectText : 'Упрямство и алчность некоторых представителей человеческого рода внезапно заставляет вас вспыхнуть праведным гневом. Немного успокоившись вы, кажется, можете найти несколько доводов, чтобы их переубедить.',
	},
	
	//Заинтересованность смежных отраслей
	neighborPlan : {
		collected : false,
		converted : false,
		pages : 10,
		topicText : 'Указать на то, что образ "экологичности", давно уже нуждается в переосмыслении.',
		replyText : "Оптимус прайм использующий солнечные батареи. Нефтяник – архетип злодея бондианы... Остановив поток этих ненужных поп культурных спекуляций вы всё таки затрагиваете тему правильного позиционирования экологичного топлива.",
		collectText : 'Вы пытаетесь посмотреть на себя чужими глазами. Насмотревшись на это недоразумение, вы приходите к выводу, что многое можно изменить в общественном мнении, если чуть изменить угол. Кроме сферы, конечно.',
	},
	
	//Государственное регулирование
	govControl : {
		collected : false,
		converted : false,
		pages : 5,
		topicText : 'Отметить приоритеты государства в вопросе возобновляемых ресурсов.',
		replyText : "Вы описываете несколько способов регулирования отрасли. Сжав в кулак свои либеральные взгляды вы даже составляете систему обязательной модернизации производств.",
		collectText : 'Неожиданно всё окружающее кажется вам жуткой дистопией. Поразмыслив над этим немного и прикинув альтернативы, вы решаете, что она не такая уж и жуткая.',
	},
	
	// Предсказание
	futurePrediction : {
		collected : false,
		converted : false,
		pages : 6,
		topicText : 'Процитировать футурологов высказавшихся о возможных путях развития энергетической промышленности.',
		replyText : "Радужные рассуждения некоторых околонаучных деятелей добавляют вашему диплому оптимистичности. Возможно зря, но кому-то может понравиться.",
		collectText : 'Вы задумываетесь над своим будущим. Планировать, как вытащить его из болота уже слишком поздно. А вот у человечества, возможно, ещё есть немного времени. Возможно...',
	}	
};

var _array = [];
for(var k in ideas) {
	_array.push(ideas[k]);
	//ideas[k].collected = true;
}

// shuffle and add idle collect times
for(var i = 0; i < _array.length; i++) {
	var idea = _array[i];
	var swapIndex = Math.floor(Math.random() * _array.length);
	_array[i] = _array[swapIndex];
	_array[swapIndex] = idea;
}
var accum = 0;
for(var i = 0; i < _array.length; i++) {
	accum += Math.random() * 15 + 15 + 60 * (i/_array.length) * (i/_array.length);
	_array[i].idleTime = accum;
}
console.log('All ideas idle time:', accum);

var totalIdleTime = 0;

ideas.think = function(time) {
	cc.eventLoop.time += time;
	totalIdleTime += time;
	for(var i = 0; i < _array.length; i++) {
		var idea = _array[i];
		if(idea.idleTime <= totalIdleTime) {
			if(idea.collected) {
				var prevTime = _array[i-1] ? _array[i-1].idleTime : 0;
				idea._idleTime = idea.idleTime;
				idea.idleTime = 0;
				totalIdleTime += idea.idleTime - prevTime;
			} else {
				console.log('collected Idea:', idea, totalIdleTime);
				idea.collected = true;
				return idea.collectText;
			}
		}
	}
};

ideas.forgetRandom = function() {
	var forget = _array.filter((idea)=> idea.collected && !idea.converted).pickRandom();
	if(forget) {
		forget.collected = false;
	}
	return forget;
};

ideas.collect = function(ideaKey) {
	var idea = ideas[ideaKey];
	if(!idea.collected) {
		idea.collected = true;
		return idea.collectText;
	}
};

module.exports = ideas;