var playerPhases = {
	hungerChanged : [
		"Вы снова сыты",
		"У вас в животе жалобно урчит",
		"У вас темнеет в глазах от голода",
	],
	// рандомные фразы информирующие о лёгком голоде
	hungerLow : [
		'У вас в животе жалобно урчит',
		"Сейчас бы перекусить чего",
		"Внезапно вам захотелось кукурузных хлопьев с молоком",
		"Неплохо было бы поесть в обозримом будущем",
		"Когда я в последний раз кушал?"
	],
	// рандомные фразы информирующие о сильном голоде
	hungerStarve : [
		"Вам так хочется есть, что вы еле передвигаете ноги",
		"У вас темнеет в глазах от голода",
		"Живот настойчиво урчит, а перед глазами проносятся котлеты",
	]
}